const minus = require('./minus');
// 2 - 5 เท่ากับ -3
test("5 - 15 เท่ากับ -10", () => {
  expect(minus(5, 15)).toBe(-10);
});

// 6 - 2 เท่ากับ 4
test("6 - 2 เท่ากับ 4", () => {
    expect(minus(6, 2)).toBe(4);
});

// 3 - 3 เท่ากับ 0
test("3 - 3 เท่ากับ 0", () => {
    expect(minus(3, 3)).toBe(0);
});

// -7 - 7 เท่ากับ -14
test("-7 - 7 เท่ากับ -14", () => {
    expect(minus(-7, 7)).toBe(-14);
});

// 0.5 - 0.1 เท่ากับ 0.4
test("0.5 - 0.1 เท่ากับ 0.4", () => {
    expect(minus(0.5, 0.1)).toBe(0.4);
});