const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', ()=> {
  expect(sum(20,1)).toBe(21);
});

// 2 + 5 เท่ากับ ?
//  2 + 5 เท่ากับ 7
test('2 + 5 เท่ากับ 7', ()=> {
  expect(sum(5,2)).toBe(7);
});

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy
// 66 + 4 เท่ากับ 70
test('66 + 4 เท่ากับ 70', ()=>{
  expect(sum(66,4)).toBe(70);
})

// -1 + 6 เท่ากับ 5
test('-1 + 6 เท่ากับ 7', ()=> {
  expect(sum(-1,6)).toBe(5);
});


// 39 + 50 เท่ากับ 89
test('39 + 50 เท่ากับ 89', ()=> {
  expect(sum(39,50)).toBe(89);
});
